app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <div class="error-inline">
        <%= @item.errors[:category].first %>

SELECT "nonprofits".* FROM "nonprofits"
---
    <div class="controls">
      <%= f.collection_select( :nonprofit_id, Nonprofit.all, :id, :name, {:include_blank => true} ) %>