app/controllers/authentications_controller.rb

SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '545321421' LIMIT 1
INSERT INTO "authentications" ("code", "created_at", "provider", "token", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "users" ("admin", "city", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "state", "street_address", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def facebook
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create!(auth_hash(omniauth))

INSERT INTO "authentications" ("code", "created_at", "provider", "secret", "token", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def stripe_connect
    omniauth = request.env["omniauth.auth"]
    if params['state'].try(:include?, 'nonprofit')
      Nonprofit.find_and_create_auth! params['state'], auth_hash(omniauth)
      redirect_to items_path, notice: "You're successfully set up with Givespend!"
    else
      current_user.authentications.create!(auth_hash(omniauth))