app/controllers/categories_controller.rb

SELECT "items".* FROM "items" WHERE "items"."category_id" = 1
---
  def show
    @items = Item.where(category_id: params[:id]).page(params[:page]).per(8).includes(:nonprofit, :image)