app/controllers/items_controller.rb

  def create
    @item = Item.new(params[:item])
    @item.seller = current_user
    if @item.save
---
INSERT INTO "items" ("cart_id", "category_id", "charity_id", "created_at", "description", "expires_from_cart_at", "name", "percentage", "price", "purchased_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def index
    @items = Item.active.page(params[:page]).per(8).includes(:nonprofit, :image)
    @categories = Category.all
---
SELECT "items".* FROM "items"
SELECT "categories".* FROM "categories"