app/controllers/nonprofits_controller.rb

  def show
    @nonprofit = Nonprofit.find(params[:id])
---
SELECT "nonprofits".* FROM "nonprofits" WHERE "nonprofits"."id" = $1 LIMIT 1  [["id", "1"]]

  def index
    @nonprofits = Nonprofit.all
---
SELECT "nonprofits".* FROM "nonprofits"